/*===========================================================
* @file      B2MW_Timer.hpp
* @author    MRZHENG
* ===========================================================
* @brief
* 该文件依赖
* BspTimer.h
* MW_Common.hpp
* ===========================================================
* 该文件功能表述(先声明后定义):
* ===========================================================
* @version   0.1
* @date      2025-10-21
* @copyright Copyright (c) 2025
============================================================*/

#ifndef B2MW_TIMER_HPP
#define B2MW_TIMER_HPP

/*========================= 文件依赖 =========================*/
#include "BspTimer.h"
#include "MW_Common.hpp"


/*==================== Tim定时器资源使用枚举 ===================*/

/**
 * @brief 上层中间件使用的定时器枚举
 */
enum USE_Timer : uint8_t
{
    USE_TIMER1 = 0,
    USE_TIMER2 = 1,
    USE_TIMER3 = 2,
    USE_TIMER_END
};

/*========================== 宏定义 ==========================*/

/**
 * @brief 定时器最大订阅数量
 */
#define MAX_TIME_SUBSCRIPTIONS 4


/*======================= TIM 管理器类 =======================*/
/**
 * @brief 定时器
 * 
 */
class TimManger{

    
};

#endif /* B2MW_TIMER_HPP */
 